Repository: OnthSKY/Sky.Bytimex.Backend
Catalog: Source/Sky.Template.Backend.Core/Localization/SharedResource.*.resx
Languages: tr

# DatabaseErrorDefault
source: A database error occurred
tr: Veritabanı hatası oluştu

# DefaultAddressAlreadyExistsForBuyer
source: Default address already exists for this buyer
tr: Alıcının zaten varsayılan adresi var

# DescriptionMaxLength
source: Description must not exceed 500 characters
tr: Açıklama 500 karakteri geçmemelidir

source: Either buyer ID or order ID must be provided
tr: Alıcı ID veya sipariş ID'sinden biri sağlanmalıdır

# EmailInvalid
source: Email is invalid
tr: E-posta geçersiz

source: Email is required
tr: E-posta adresi gereklidir

# Erp.ConfigNotFound
source: ERP configuration not found.
tr: ERP konfigürasyonu bulunamadı.

source: First name cannot be empty
tr: Ad boş olamaz

source: First name is required
tr: Ad gereklidir

# FirstNameMaxLength
source: First name must not exceed 50 characters
tr: Ad 50 karakterden uzun olamaz

source: Forbidden Access
tr: Yetkisiz işlem

source: Internal server error
tr: Sunucu hatası

source: Invalid credentials
tr: Giriş bilgileri geçersiz

source: Invalid email format
tr: Geçersiz e-posta formatı

source: Invalid payment status
tr: Geçersiz ödeme durumu

source: Invalid payment type
tr: Geçersiz ödeme türü

source: Invalid user ID
tr: Geçersiz kullanıcı ID

source: Last name cannot be empty
tr: Soyad boş olamaz

source: Last name is required
tr: Soyad gereklidir

# LastNameMaxLength
source: Last name must not exceed 50 characters
tr: Soyad 50 karakterden uzun olamaz

source: Login successful
tr: Giriş başarılı

source: Logout Successful
tr: Çıkış başarılı

# OrderDirectionPropNotFound
source: Sorting direction can only be ASC or DESC.
tr: Sıralama yönü sadece ASC veya DESC olabilir.

source: Order not found
tr: Sipariş bulunamadı

source: Password is required
tr: Şifre gereklidir

# PasswordLowercaseRequired
source: Password must contain at least one lowercase letter
tr: Şifre en az bir küçük harf içermelidir

# PasswordMinLength
source: Password must be at least 8 characters
tr: Şifre en az 8 karakter olmalıdır

# PasswordNumberRequired
source: Password must contain at least one number
tr: Şifre en az bir rakam içermelidir

# PasswordRequired
source: Password is required
tr: Şifre alanı zorunlu

# PasswordSpecialCharRequired
source: Password must contain at least one special character
tr: Şifre en az bir özel karakter içermelidir

# PasswordUppercaseRequired
source: Password must contain at least one uppercase letter
tr: Şifre en az bir büyük harf içermelidir

source: Permission ID cannot be empty
tr: İzin ID boş olamaz

source: Permission ID is required
tr: İzin ID zorunludur

source: Permission name is required
tr: İzin adı zorunludur

# PermissionNameMaxLength
source: Permission name must not exceed 50 characters
tr: İzin adı 50 karakteri geçmemelidir

# PhoneIsRequired
source: Phone number is required
tr: Telefon numarası gereklidir

source: Refresh Successful
tr: İşlem Başarılı

source: Refresh Token Invalid
tr: Refresh token geçersiz

source: Refresh token not found
tr: Refresh token bulunamadı

source: Registration failed
tr: Kayıt işlemi başarısız oldu

source: RoleId Can not Be Empty
tr: RoleId alanı zorunlu

source: Role ID is required
tr: Rol ID zorunludur

source: Role name is required
tr: Rol adı zorunludur

# RoleNameMaxLength
source: Role name must not exceed 50 characters
tr: Rol adı 50 karakteri geçmemelidir

# RoleNotFound
source: Role is Not Found
tr: Rol bulunamadı

# RoleNotFoundWithId
source: Role with ID {0} not found.
tr: ID'si {0} olan rol bulunamadı.

source: Status cannot be empty
tr: Durum boş olamaz

source: Status is required
tr: Durum zorunludur

source: Status must be Active or Inactive
tr: Durum Aktif ya da Pasif olmalıdır

source: Unauthorized access
tr: Yetkisiz erişim

# UnexpectedError
source: An unexpected error occurred
tr: Beklenmeyen bir hata oluştu

# UserAlreadyExists
source: A user with this email already exists
tr: Bu e-posta adresi ile kayıtlı bir kullanıcı zaten mevcut

source: UserId Can not Be Empty
tr: UserId alanı zorunlu

source: User not found.
tr: Kullanıcı Bulunamadı

# UserNotFoundWithEmails
source: User with EMAIL : {0} not found.
tr: eMail'i {0} olan kullanıcı bulunamadı.

# UserNotFoundWithId
source: User with ID {0} not found.
tr: ID'si {0} olan kullanıcı bulunamadı.

# UsernameRequired
source: UserName is required
tr: Kullanıcı Adı alanı zorunlu

# Validation.AuthToken.RequiredIfAuthenticated
source: AuthToken is required when authentication is enabled.
tr: Kimlik doğrulama isteniyorsa AuthToken girilmelidir.

# Validation.ContentType.Required
source: Content-Type cannot be empty.
tr: İçerik tipi (Content-Type) boş olamaz.

# Validation.ContentType.Unsupported
source: Only 'application/json' is supported.
tr: Yalnızca 'application/json' desteklenmektedir.

# Validation.Method.Required
source: HTTP method must be specified.
tr: HTTP method belirtilmelidir.

# Validation.Url.Invalid
source: Please enter a valid URL.
tr: Geçerli bir URL giriniz.

# Validation.Url.Required
source: URL field cannot be empty.
tr: Url alanı boş olamaz.

source: Invalid payment method type
tr: Geçersiz ödeme yöntemi türü

# InvalidCurrencyCode
source: Currency code must be a valid ISO code
tr: Para birimi kodu geçerli bir ISO kodu olmalıdır

# Validation.Required
source: This field is required.
tr: Bu alan zorunludur.

# Validation.InvalidEmail
source: Invalid email format.
tr: Geçersiz e-posta formatı.

# Validation.InvalidCurrency
source: Invalid currency code.
tr: Geçersiz para birimi.

# Validation.InvalidStatus
source: Invalid status value.
tr: Geçersiz durum.

# Validation.InvalidPrice
source: Price must be greater than zero.
tr: Fiyat sıfırdan büyük olmalıdır.

# Validation.InvalidGuid
source: Invalid identifier.
tr: Geçersiz tanımlayıcı.

# Validation.InvalidDate
source: Invalid date value.
tr: Geçersiz tarih değeri.

# Validation.MaxLength
source: Value exceeds maximum length.
tr: Değer izin verilen uzunluğu aşıyor.

source: Service method cannot be null
tr: Servis metodu boş olamaz

source: Response was null
tr: Yanıt boş döndü

source: Connection string not found.
tr: Bağlantı dizesi bulunamadı.

source: Unsupported database provider.
tr: Desteklenmeyen veritabanı sağlayıcısı.

# CommitWithoutTransaction
source: Cannot commit: No transaction has been started.
tr: Commit yapılamaz: Başlatılmış bir işlem yok.

source: Unsupported provider.
tr: Desteklenmeyen sağlayıcı.

# NotAValidationClass
source: Type is not a validation class.
tr: Bu bir doğrulama sınıfı değil.

# ValidatorNotResolved
source: Validator of type {0} could not be resolved.
tr: Tip {0} doğrulayıcı çözümlenemedi.

# CacheServiceNotResolved
source: Cache service could not be resolved.
tr: Önbellek servisi çözümlenemedi.

# CacheKeyPatternNotFound
source: Cache key pattern '{0}' not found.
tr: Önbellek anahtar deseni '{0}' bulunamadı.

# UserIdRequiredForUserResourcesPattern
source: UserId is required for user resources pattern.
tr: Kullanıcı kaynak deseni için UserId gereklidir.

# RoleIdRequiredForRoleCacheInvalidation
source: RoleId is required for role cache invalidation.
tr: Rol önbelleği temizliği için RoleId gereklidir.

# CacheKeyPrefixNotFound
source: Cache key prefix '{0}' not found.
tr: Önbellek anahtar öneki '{0}' bulunamadı.

# BaseSqlMustContainFrom
source: Base SQL must contain a FROM clause.
tr: Temel SQL ifadede FROM cümlesi bulunmalıdır.

# HttpContextAccessorNotResolved
source: IHttpContextAccessor could not be resolved.
tr: IHttpContextAccessor çözümlenemedi.

# PropertyNotFoundInRequest
source: Property '{0}' not found in request.
tr: İstek içinde '{0}' özelliği bulunamadı.

# PropertyIsRequired
source: Property '{0}' is required.
tr: '{0}' alanı zorunludur.

# UserIdNotActive
source: User ID '{0}' is not active.
tr: Kullanıcı ID '{0}' aktif değil.

# PaymentMethodNotSupported
source: Payment method {0} is not supported.
tr: {0} ödeme yöntemi desteklenmiyor.

source: Unknown error
tr: Bilinmeyen hata

source: Invalid shipment status
tr: Geçersiz gönderi durumu

source: Full name is required
tr: Tam ad gereklidir

# FullNameMaxLength
source: Full name must not exceed 100 characters
tr: Tam ad 100 karakteri geçmemelidir

# InvalidPage
source: Page must be greater than zero
tr: Sayfa 0'dan büyük olmalıdır

# InvalidPageSize
source: Page size must be between 1 and 100
tr: Sayfa boyutu 1 ile 100 arasında olmalıdır

# InvalidPostalCode
source: Invalid postal code format
tr: Geçersiz posta kodu formatı

source: Role assignment failed.
tr: Rol ataması başarısız oldu.

# DbOperationFailed
source: Database operation failed.
tr: Veritabanı işlemi başarısız oldu.

# Claims.UserId.NotFound
source: User ID claim not found.
tr: Kullanıcı ID claim'i bulunamadı.

# Claims.Email.NotFound
source: Email claim not found.
tr: E-posta claim'i bulunamadı.

# Claims.Schema.NotFound
source: Schema claim not found.
tr: Şema claim'i bulunamadı.

# UserNotFoundWithEmail
source: User with email {0} not found.
tr: {0} e-postası ile kullanıcı bulunamadı.

source: Brand created
tr: Marka oluşturuldu

source: Brand updated
tr: Marka güncellendi

source: Brand deleted
tr: Marka silindi

source: Brand hard deleted
tr: Marka kalıcı olarak silindi

# Error.Brand.NotFound
source: Brand not found
tr: Marka bulunamadı

# Error.Brand.Code.Exists
source: Brand code already exists
tr: Marka kodu zaten mevcut

# Error.Brand.VendorCreateDisabled
source: Vendor brand creation is disabled
tr: Satıcı marka oluşturma devre dışı

# Error.Brand.VendorUpdateForbidden
source: Vendor brand update is forbidden
tr: Satıcı markayı güncelleyemez

# Error.Brand.VendorDeleteForbidden
source: Vendor brand delete is forbidden
tr: Satıcı markayı silemez

# Validation.Brand.Id.Required
source: Brand id is required
tr: Marka kimliği gerekli

# Validation.Brand.Code.Required
source: Code is required
tr: Kod gerekli

# Validation.Brand.Code.InvalidFormat
source: Invalid brand code format
tr: Geçersiz marka kodu formatı

# Validation.Brand.Code.Length
source: Brand code length must be between 2 and 100
tr: Marka kodu uzunluğu 2 ile 100 arasında olmalıdır

# Validation.Brand.Translations.Required
source: Translations are required
tr: Çeviriler gereklidir

# Validation.Brand.Translation.LanguageCode.Required
source: Language code is required
tr: Dil kodu gerekli

# Validation.Brand.Translation.Name.Required
source: Name is required
tr: İsim gerekli

# Validation.Brand.Translation.Name.Length
source: Name length must not exceed 200
tr: İsim uzunluğu 200'ü aşmamalıdır

# Validation.Brand.Status.Invalid
source: Invalid brand status
tr: Geçersiz marka durumu

# Users.EmailAlreadyExists
source: This email is already registered.
tr: Bu e-posta zaten kayıtlı.

# Referrals.Code.Invalid
source: Invalid referral code.
tr: Geçersiz referans kodu.

# Referrals.Code.NotFound
source: Referrer user not found.
tr: Referans veren kullanıcı bulunamadı.

# Referrals.SelfReferral.NotAllowed
source: Self-referral is not allowed.
tr: Kendi kendine referans verilemez.
